barath0508/Solar_Tracker/esp32_c6_solar_tracker/esp32_c6_solar_tracker.ino
#include <WiFi.h>
#include <HTTPClient.h>
#include <WiFiClientSecure.h>
#include <Update.h>
#include <Wire.h>
#include <esp_arduino_version.h>
#include <LiquidCrystal_I2C.h>
#include <Adafruit_INA219.h>
#include <DHT.h>

// Custom crash-proof Servo implementation for ESP32-C6 (bypasses buggy ESP32Servo library)
class Servo {
private:
  int _pin;
  int _channel;
public:
  Servo() : _pin(-1), _channel(-1) {}
  
  void setPeriodHertz(int hz) {
    // 50Hz is standard for servos
  }
  
  void attach(int pin, int minPulse = 500, int maxPulse = 2400) {
    _pin = pin;
    #if defined(ESP_ARDUINO_VERSION) && ESP_ARDUINO_VERSION >= ESP_ARDUINO_VERSION_VAL(3, 0, 0)
      ledcAttach(_pin, 50, 14); // 50Hz, 14-bit resolution
    #else
      static int nextChannel = 0;
      _channel = nextChannel++;
      ledcSetup(_channel, 50, 14); // 50Hz, 14-bit resolution
      ledcAttachPin(_pin, _channel);
    #endif
  }
  
  void write(int angle) {
    if (_pin == -1) return;
    int pulseWidthUs = map(angle, 0, 180, 500, 2400);
    // 50Hz = 20000us period. 14-bit resolution = 16383 max duty
    int duty = map(pulseWidthUs, 0, 20000, 0, 16383);
    
    #if defined(ESP_ARDUINO_VERSION) && ESP_ARDUINO_VERSION >= ESP_ARDUINO_VERSION_VAL(3, 0, 0)
      ledcWrite(_pin, duty);
    #else
      ledcWrite(_channel, duty);
    #endif
  }
};

// ==========================================
// User Credentials & Server Configuration
// ==========================================
// Replace with your local Wi-Fi credentials
const char* ssid = "BS";
const char* password = "bhavani06";

// 1. Local Dev Server Settings
const char* localHost = "http://192.168.137.60:5173";

// 2. Production Vercel Server Settings (Replace with your actual deployed Vercel domain)
// Note: If left as default/placeholder, Vercel requests will be bypassed to avoid timeout lags.
const char* vercelHost = "https://solar-tracker-pi-jade.vercel.app";

// Helper to check if Vercel server host is configured and should be used
bool shouldUseVercel() {
  String host = String(vercelHost);
  return (host.length() > 0 && host.indexOf("your-vercel-project") == -1 && host.startsWith("http"));
}

// Target Device ID registered in your website's database
// Default for Rajalakshmi Institute of Technology: "d1e028b0-a541-4702-8c20-3354316d2cf1"
#define DEVICE_ID "d1e028b0-a541-4702-8c20-3354316d2cf1"

// ==========================================
// ESP32-C6 Pin Mappings
// ==========================================
// Standard ESP32 pins (32, 33, 34, 35) do not exist on the ESP32-C6.
// Remapped to ADC1 channels on ESP32-C6:
#define LDR_TL 0  // GPIO 0 (ADC1_CH0)
#define LDR_TR 1  // GPIO 1 (ADC1_CH1)
#define LDR_BL 2  // GPIO 2 (ADC1_CH2)
#define LDR_BR 3  // GPIO 3 (ADC1_CH3)

// Servos
#define SERVO_H_PIN 18
#define SERVO_V_PIN 19

// Buzzer Connection
#define BUZZER_PIN 5

// I2C pins for ESP32-C6
#define I2C_SDA 6
#define I2C_SCL 7

// ==========================================
// LCD
// ==========================================
LiquidCrystal_I2C lcd(0x27, 16, 2);

// ==========================================
// INA219
// ==========================================
Adafruit_INA219 ina219;

// ==========================================
// DHT11 Sensor
// ==========================================
#define DHT_PIN 4
#define DHT_TYPE DHT11
DHT dht(DHT_PIN, DHT_TYPE);

// ==========================================
// Servo Objects
// ==========================================
Servo horizontalServo;
Servo verticalServo;

// ==========================================
// State Variables
// ==========================================
int servoH = 90;
int servoV = 45;

const int H_MIN = 0;
const int H_MAX = 180;

const int V_MIN = 10;
const int V_MAX = 100;

// Tracking tolerance — very low for torch demo (react to any light imbalance)
const int tolerance = 3;

// Mode control (Auto-tracking vs Remote steering override)
bool isAutoTracking = true;

// Diagnostic Status
int systemFaultCode = 0; // 0=Nominal, 1=Dust/Soiling, 3=Overheat, 4=Motor Blockage, 5=Sensor Fault, 7=Open Circuit, 8=Closed Circuit, 9=Solar Panel Fault
unsigned long lastTelemetryTime = 0;
unsigned long lastCommandPollTime = 0;

const unsigned long telemetryInterval    = 2000; // POST telemetry every 2s
const unsigned long commandPollInterval  =  500; // Poll Supabase commands every 500ms
const unsigned long overridePollInterval =  100; // Poll fast-lane override every 100ms
unsigned long lastOverridePollTime = 0;

// Forward Declarations
void connectWiFi();
void sendTelemetry();
void sendTelemetryTo(const char* host, float v, float i_mA, float p_mW, float temp, float humidity, int tl, int bl, int tr, int br);
void sendFaultAlert(String severity, String message);
void sendFaultAlertTo(const char* host, String severity, String message);
void pollCommands();
void pollCommandsFrom(const char* host);
void pollFastLaneOverride(); // Fast-lane 100ms override poll (local only)
void runCleaningSweep();
void performOTA(String url, String md5);
float readTemperature();
float readHumidity();

// ==========================================
// Setup
// ==========================================
void setup()
{
  Serial.begin(115200);

  // Initialize I2C with ESP32-C6 pins
  Wire.begin(I2C_SDA, I2C_SCL);

  // LCD
  lcd.init();
  lcd.backlight();
  lcd.print("ESP32-C6 Solar");
  lcd.setCursor(0, 1);
  lcd.print("Booting up...");

  // INA219
  if (!ina219.begin())
  {
    Serial.println("INA219 NOT FOUND!");
    lcd.clear();
    lcd.print("INA219 Error");
    systemFaultCode = 5; // Sensor fault
    delay(2000);
  }

  // DHT
  dht.begin();

  // Servo setup
  horizontalServo.setPeriodHertz(50);
  verticalServo.setPeriodHertz(50);

  horizontalServo.attach(SERVO_H_PIN, 500, 2400);
  verticalServo.attach(SERVO_V_PIN, 500, 2400);

  horizontalServo.write(servoH);
  verticalServo.write(servoV);

  // Buzzer Setup
  pinMode(BUZZER_PIN, OUTPUT);
  digitalWrite(BUZZER_PIN, LOW);

  // Connect to Local Wi-Fi
  connectWiFi();

  lcd.clear();
  lcd.setCursor(0, 0);
  lcd.print("Solar Tracker");
  lcd.setCursor(0, 1);
  lcd.print("ESP32-C6 Ready");

  delay(2000);
}

// ==========================================
// Main Loop
// ==========================================
void loop()
{
  // 1. Maintain Wi-Fi Connection (Non-blocking background reconnect)
  static unsigned long lastWifiCheck = 0;
  if (WiFi.status() != WL_CONNECTED) {
    static unsigned long lastLcdUpdate = 0;
    if (millis() - lastLcdUpdate >= 5000) {
      lastLcdUpdate = millis();
      lcd.clear();
      lcd.print("WiFi Offline");
      lcd.setCursor(0, 1);
      lcd.print("Reconnecting...");
    }
    
    if (lastWifiCheck == 0 || millis() - lastWifiCheck >= 15000) {
      lastWifiCheck = millis();
      Serial.println("Wi-Fi disconnected. Reconnecting in background...");
      WiFi.disconnect(false);
      delay(50);
      WiFi.begin(ssid, password);
    }
  } else {
    lastWifiCheck = 0; // Reset check timer once connected
  }

  // 2. Perform closed-loop tracking if in AUTO mode
  int tl = analogRead(LDR_TL);
  int tr = analogRead(LDR_TR);
  int bl = analogRead(LDR_BL);
  int br = analogRead(LDR_BR);

  if (isAutoTracking)
  {
    // Calculate averages exactly as the web dashboard does
    int avt = (tl + tr) / 2;  // Top average
    int avd = (bl + br) / 2;  // Bottom average
    int avl = (tl + bl) / 2;  // Left average
    int avr = (tr + br) / 2;  // Right average

    // Compute absolute deltas
    int dvert  = avt - avd;   
    int dhoriz = avl - avr;   

    // Web Dashboard formula for azimuth: (leftAvg - rightAvg) * 0.05
    int calcAzimuth = dhoriz * 0.05;
    calcAzimuth = constrain(calcAzimuth, -45, 45);
    
