barath0508/Solar_Tracker/esp32_c6_solar_tracker/esp32_c6_solar_tracker.ino
    // Map to horizontal servo (assuming 90 is center/forward)
    servoH = 90 + calcAzimuth;
    servoH = constrain(servoH, H_MIN, H_MAX);
    horizontalServo.write(servoH);

    // Apply the same proportional mapping to elevation (vertical)
    int calcElevation = dvert * 0.05;
    calcElevation = constrain(calcElevation, -45, 45);
    
    // Map to vertical servo (assuming 45 is the resting center point based on V_MIN=10, V_MAX=100)
    servoV = 45 + calcElevation;
    servoV = constrain(servoV, V_MIN, V_MAX);
    verticalServo.write(servoV);
  }

  // 3. Read Electrical & Environmental Sensors
  float busVoltage = 0.0;
  float current_mA = 0.0;
  float power_mW = 0.0;

  if (systemFaultCode != 5) {
    busVoltage = ina219.getBusVoltage_V();
    current_mA = ina219.getCurrent_mA();
    power_mW = ina219.getPower_mW();
  }

  float temp = readTemperature();
  float humidity = readHumidity();

  // 4. Overheat Safety Interlocking
  if (temp > 65.0 && systemFaultCode != 3) {
    systemFaultCode = 3; // Overheat
    sendFaultAlert("critical", "Critical temperature anomaly: " + String(temp, 1) + "C. Risk of thermal degradation.");
    // Move to safe stow angle immediately
    isAutoTracking = false;
    servoH = 90;
    servoV = V_MIN;
    horizontalServo.write(servoH);
    verticalServo.write(servoV);
  } else if (temp <= 60.0 && systemFaultCode == 3) {
    systemFaultCode = 0; // Temp recovered
    isAutoTracking = true;
  }

  // 4b. Electrical Fault Detection (Open Circuit, Closed Circuit, Solar Panel Fault)
  if (systemFaultCode != 5 && systemFaultCode != 3) {
    bool isVoltageZero = (busVoltage < 0.1);
    bool isCurrentZero = (current_mA < 0.1);

    if (isVoltageZero && isCurrentZero) {
      if (systemFaultCode != 9) {
        systemFaultCode = 9; // Solar Panel Fault
        sendFaultAlert("critical", "Solar Panel Fault detected: both voltage and current are zero.");
      }
    } else if (isVoltageZero) {
      if (systemFaultCode != 8) {
        systemFaultCode = 8; // Closed Circuit Fault
        sendFaultAlert("critical", "Closed Circuit Fault detected: voltage is zero while current is drawn.");
      }
    } else if (isCurrentZero) {
      if (systemFaultCode != 7) {
        systemFaultCode = 7; // Open Circuit Fault
        sendFaultAlert("warning", "Open Circuit Fault detected: current is zero while voltage remains positive.");
      }
    } else {
      // Clear electrical faults if conditions are healthy
      if (systemFaultCode == 7 || systemFaultCode == 8 || systemFaultCode == 9) {
        systemFaultCode = 0; // Nominal
      }
    }
  }

  // 5. Publish Telemetry to Website API
  if (millis() - lastTelemetryTime >= telemetryInterval) {
    sendTelemetry();
    lastTelemetryTime = millis();
  }

  // 6. Poll Pending Control Commands (Supabase — stow / clean / reboot / OTA)
  if (millis() - lastCommandPollTime >= commandPollInterval) {
    pollCommands();
    lastCommandPollTime = millis();
  }

  // 6b. Fast-lane override poll (local server only — 100ms for snappy manual control)
  if (millis() - lastOverridePollTime >= overridePollInterval) {
    pollFastLaneOverride();
    lastOverridePollTime = millis();
  }

  // 6c. Buzzer Alarm Signal Toggling (Non-blocking beep pattern)
  if (systemFaultCode != 0) {
    int beepInterval = 1000;
    if (systemFaultCode == 3 || systemFaultCode == 9) {
      // Overheat or Solar Panel Fault (Critical) -> Fast beep
      beepInterval = 300;
    } else if (systemFaultCode == 7 || systemFaultCode == 8 || systemFaultCode == 5 || systemFaultCode == 4) {
      // Electrical Warning, Motor Block, or Sensor Fault -> Medium beep
      beepInterval = 600;
    } else {
      // Dust cover or other warnings -> Slow beep
      beepInterval = 1200;
    }
    bool buzzerState = (millis() / beepInterval) % 2 == 0;
    digitalWrite(BUZZER_PIN, buzzerState ? HIGH : LOW);
  } else {
    digitalWrite(BUZZER_PIN, LOW); // Silent when nominal
  }

  // 7. Render local LCD
  lcd.clear();
  lcd.setCursor(0, 0);
  lcd.print("V:");
  lcd.print(busVoltage, 1);
  lcd.print(" T:");
  lcd.print((int)temp);
  lcd.print(" H:");
  lcd.print((int)humidity);

  lcd.setCursor(0, 1);
  if (isAutoTracking) {
    lcd.print("P:");
    lcd.print(power_mW / 1000.0, 2);
    lcd.print(" H:");
    lcd.print(servoH);
  } else {
    lcd.print("MANUAL H:");
    lcd.print(servoH);
    lcd.print(" V:");
    lcd.print(servoV);
  }

  delay(5); // 5ms loop — 200Hz tracking, up to 4000°/s max slew with 20° steps
}

// ==========================================
// Helper Functions
// ==========================================

int getJsonInt(String json, String key) {
  int keyIdx = json.indexOf("\"" + key + "\"");
  if (keyIdx == -1) return -999;
  
  int colonIdx = json.indexOf(":", keyIdx + key.length() + 2);
  if (colonIdx == -1) return -999;
  
  int start = colonIdx + 1;
  while (start < json.length() && isSpace(json.charAt(start))) {
    start++;
  }
  
  int end = start;
  while (end < json.length() && (isDigit(json.charAt(end)) || json.charAt(end) == '-' || json.charAt(end) == '+')) {
    end++;
  }
  
  if (start == end) return -999;
  return json.substring(start, end).toInt();
}

bool getJsonBool(String json, String key, bool defaultValue) {
  int keyIdx = json.indexOf("\"" + key + "\"");
  if (keyIdx == -1) return defaultValue;
  
  int colonIdx = json.indexOf(":", keyIdx + key.length() + 2);
  if (colonIdx == -1) return defaultValue;
  
  int start = colonIdx + 1;
  while (start < json.length() && isSpace(json.charAt(start))) {
    start++;
  }
  
  if (json.substring(start, start + 4) == "true") return true;
  if (json.substring(start, start + 5) == "false") return false;
  return defaultValue;
}

String getJsonString(String json, String key) {
  int keyIdx = json.indexOf("\"" + key + "\"");
  if (keyIdx == -1) return "";
  
  int colonIdx = json.indexOf(":", keyIdx + key.length() + 2);
  if (colonIdx == -1) return "";
  
  int startQuote = json.indexOf("\"", colonIdx + 1);
  if (startQuote == -1) return "";
  
  int endQuote = json.indexOf("\"", startQuote + 1);
  if (endQuote == -1) return "";
  
  String val = json.substring(startQuote + 1, endQuote);
  val.replace("\\/", "/"); 
  return val;
}

void connectWiFi() {
  if (WiFi.status() == WL_CONNECTED) return;
  
  // Ensure we terminate any active background connection attempts first
  WiFi.disconnect(false);
  delay(100);
  
  Serial.print("Connecting to Wi-Fi SSID: ");
  Serial.println(ssid);
  
  lcd.clear();
  lcd.print("Connecting WiFi");
  lcd.setCursor(0, 1);
  lcd.print(ssid);

  WiFi.begin(ssid, password);
  
  int attempts = 0;
  while (WiFi.status() != WL_CONNECTED && attempts < 25) {
    delay(500);
    Serial.print(".");
    attempts++;
  }
  
  if (WiFi.status() == WL_CONNECTED) {
    Serial.println("\nWi-Fi Connected!");
    Serial.print("Local IP Address: ");
    Serial.println(WiFi.localIP());
    lcd.clear();
    lcd.print("WiFi Connected");
    lcd.setCursor(0, 1);
    lcd.print(WiFi.localIP());
  } else {
    Serial.println("\nWi-Fi connection failed.");
    lcd.clear();
    lcd.print("WiFi Fail!");
  }
  delay(1000);
}

float readTemperature() {
  // Try reading from DHT11 first
  float temp = dht.readTemperature();
  if (!isnan(temp) && temp >= -20.0 && temp <= 100.0) {
    return temp;
  }

