barath0508/Solar_Tracker/esp32_c6_solar_tracker/esp32_c6_solar_tracker.ino
  // Read ESP32-C6 internal core temperature
  #if defined(ESP32)
  temp = temperatureRead();
  if (isnan(temp) || temp < -40.0 || temp > 150.0) {
    // Return simulated ambient temp if internal read is out of bounds
    return 32.5 + random(-10, 10) / 10.0;
  }
  return temp;
  #else
  return 30.2;
  #endif
}

float readHumidity() {
  float hum = dht.readHumidity();
  if (isnan(hum) || hum < 0.0 || hum > 100.0) {
    return 55.0; // fallback to 55%
  }
  return hum;
}

void sendTelemetryTo(const char* host,
                     float busVoltage, float current_mA, float power_mW,
                     float temp, float humidity,
                     int ldr_tl, int ldr_bl, int ldr_tr, int ldr_br) {
  if (WiFi.status() != WL_CONNECTED) return;

  HTTPClient http;
  WiFiClient client;
  WiFiClientSecure clientSecure;

  String url = String(host) + "/api/telemetry";
  bool success = false;
  if (url.startsWith("https://")) {
    clientSecure.setInsecure();
    success = http.begin(clientSecure, url);
  } else {
    success = http.begin(client, url);
  }

  if (!success) {
    Serial.printf("[Telemetry] HTTP begin failed for: %s\n", host);
    return;
  }

  http.addHeader("Content-Type", "application/json");

  // Ingested current and power are scaled to Amps and Watts for web graphing compatibility
  String json = "{";
  json += "\"device_id\":\"" + String(DEVICE_ID) + "\",";
  json += "\"v\":" + String(busVoltage, 2) + ",";
  json += "\"i\":" + String(current_mA / 1000.0, 4) + ",";
  json += "\"p\":" + String(power_mW / 1000.0, 4) + ",";
  json += "\"temp\":" + String(temp, 1) + ",";
  json += "\"humidity\":" + String(humidity, 1) + ",";
  json += "\"fault\":" + String(systemFaultCode) + ",";
  json += "\"ldr\":[" + String(ldr_tl) + ","
                      + String(ldr_bl) + ","
                      + String(ldr_tr) + ","
                      + String(ldr_br) + "]";
  json += "}";

  int httpCode = http.POST(json);
  String response = http.getString();
  Serial.printf("[Telemetry] POST Code: %d, Response: %s (Host: %s)\n", httpCode, response.c_str(), host);

  http.end();
}

void sendTelemetry() {
  // Read all sensors ONCE per cycle
  float busVoltage = (systemFaultCode != 5) ? ina219.getBusVoltage_V() : 0.0;
  float current_mA = (systemFaultCode != 5) ? ina219.getCurrent_mA() : 0.0;
  float power_mW   = (systemFaultCode != 5) ? ina219.getPower_mW()   : 0.0;
  float temp       = readTemperature();
  float humidity   = readHumidity();
  int   ldr_tl     = analogRead(LDR_TL);  // Top-Left
  int   ldr_bl     = analogRead(LDR_BL);  // Bottom-Left
  int   ldr_tr     = analogRead(LDR_TR);  // Top-Right
  int   ldr_br     = analogRead(LDR_BR);  // Bottom-Right

  // ---- Serial Monitor Live Readings (printed once per cycle) ----
  Serial.println(F("========= SENSOR READINGS ========="));
  Serial.printf("  Voltage   : %.2f V\n",               busVoltage);
  Serial.printf("  Current   : %.2f mA  (%.4f A)\n",    current_mA, current_mA / 1000.0);
  Serial.printf("  Power     : %.2f mW  (%.4f W)\n",    power_mW,   power_mW   / 1000.0);
  Serial.printf("  Temp      : %.1f C\n",                temp);
  Serial.printf("  Humidity  : %.1f %%\n",               humidity);
  Serial.printf("  LDR TL/BL/TR/BR : %d / %d / %d / %d\n", ldr_tl, ldr_bl, ldr_tr, ldr_br);

  // Compute differences for diagnostic visibility
  int avt = (ldr_tl + ldr_tr) / 2;
  int avd = (ldr_bl + ldr_br) / 2;
  int avl = (ldr_tl + ldr_bl) / 2;
  int avr = (ldr_tr + ldr_br) / 2;
  Serial.printf("  Avg Top/Bot/Left/Right: %d / %d / %d / %d\n", avt, avd, avl, avr);
  Serial.printf("  Vert diff: %d  |  Horiz diff: %d  |  Tol: %d\n", avt - avd, avl - avr, tolerance);
  Serial.printf("  Fault Code: %d | Mode: %s\n",        systemFaultCode, isAutoTracking ? "AUTO" : "MANUAL");
  Serial.printf("  Servo H/V : %d / %d\n",              servoH, servoV);
  Serial.println(F("==================================="));

  // Post the same snapshot to both endpoints
  sendTelemetryTo(localHost, busVoltage, current_mA, power_mW, temp, humidity, ldr_tl, ldr_bl, ldr_tr, ldr_br);
  if (shouldUseVercel()) {
    sendTelemetryTo(vercelHost, busVoltage, current_mA, power_mW, temp, humidity, ldr_tl, ldr_bl, ldr_tr, ldr_br);
  }
}

void sendFaultAlertTo(const char* host, String severity, String message) {
  if (WiFi.status() != WL_CONNECTED) return;

  HTTPClient http;
  WiFiClient client;
  WiFiClientSecure clientSecure;
  
  String url = String(host) + "/api/faults";
  bool success = false;
  if (url.startsWith("https://")) {
    clientSecure.setInsecure();
    success = http.begin(clientSecure, url);
  } else {
    success = http.begin(client, url);
  }

  if (!success) return;

  http.addHeader("Content-Type", "application/json");

  String json = "{";
  json += "\"device_id\":\"" + String(DEVICE_ID) + "\",";
  json += "\"severity\":\"" + severity + "\",";
  json += "\"message\":\"" + message + "\"";
  json += "}";

  int httpCode = http.POST(json);
  String response = http.getString();
  Serial.printf("[Fault Alert] Status Code: %d, Response: %s (Host: %s)\n", httpCode, response.c_str(), host);
  http.end();
}

void sendFaultAlert(String severity, String message) {
  sendFaultAlertTo(localHost, severity, message);
  if (shouldUseVercel()) {
    sendFaultAlertTo(vercelHost, severity, message);
  }
}

void pollCommandsFrom(const char* host) {
  if (WiFi.status() != WL_CONNECTED) return;

  HTTPClient http;
  WiFiClient client;
  WiFiClientSecure clientSecure;
  
  String url = String(host) + "/api/commands/poll?device_id=" + String(DEVICE_ID);
  bool success = false;
  
  if (url.startsWith("https://")) {
    clientSecure.setInsecure();
    success = http.begin(clientSecure, url);
  } else {
    success = http.begin(client, url);
  }

  if (!success) return;

  int httpCode = http.GET();

  if (httpCode == HTTP_CODE_OK) {
    String response = http.getString();
    Serial.println("[Commands Poll] Response: " + response + " (Host: " + host + ")");

    // Parse commands using index matching (lightweight, zero dependency)
    if (response.indexOf("\"action\"") != -1) {
      String action = "";
      int actionIdx = response.indexOf("\"action\":\"");
      if (actionIdx != -1) {
        int start = actionIdx + 10;
        int end = response.indexOf("\"", start);
        action = response.substring(start, end);
        Serial.println("[Command Router] Parsed Action: " + action);
      }

      if (action == "reboot") {
        Serial.println("Reboot command acknowledged. Resetting chip...");
        lcd.clear();
        lcd.print("Remote Reboot...");
        delay(1000);
        ESP.restart();
      }
      else if (action == "stow") {
        Serial.println("Stow command acknowledged. Locking panel flat...");
        isAutoTracking = false;
        servoH = 90;
        servoV = V_MIN;
        horizontalServo.write(servoH);
        verticalServo.write(servoV);
        lcd.clear();
        lcd.print("Mode: STOWED (0)");
      }
      else if (action == "clean") {
        Serial.println("Clean command acknowledged. Initiating wiper sweep...");
        runCleaningSweep();
      }
      else if (action == "override") {
        Serial.println("Manual override angles received.");
        
        isAutoTracking = getJsonBool(response, "auto", true);
        
        int azimuth = getJsonInt(response, "azimuth");
        if (azimuth != -999) {
          // Adjust horizontal servo. Negative azimuth (East) -> Larger servo angle
          servoH = constrain(90 - azimuth, H_MIN, H_MAX);
          horizontalServo.write(servoH);
          Serial.printf("Set manual horizontal servo to %d deg\n", servoH);
        }
        
