barath0508/Solar_Tracker/esp32_c6_solar_tracker/esp32_c6_solar_tracker.ino
        int elevation = getJsonInt(response, "elevation");
        if (elevation != -999) {
          servoV = constrain(elevation, V_MIN, V_MAX);
          verticalServo.write(servoV);
          Serial.printf("Set manual vertical servo to %d deg\n", servoV);
        }

        lcd.clear();
        if (isAutoTracking) {
          lcd.print("Mode: AUTO");
        } else {
          lcd.print("Mode: OVERRIDE");
          lcd.setCursor(0, 1);
          lcd.printf("H:%d V:%d", servoH, servoV);
        }
      }
      else if (action == "calibrate") {
        // Calibrate action triggers the OTA update pipeline
        String otaUrlStr = getJsonString(response, "ota_url");
        String md5Hash = getJsonString(response, "md5_hash");

        if (otaUrlStr.length() > 0) {
          Serial.println("OTA deployment package detected. Fetching...");
          performOTA(otaUrlStr, md5Hash);
        }
      }
    }
  } else {
    // Suppress verbose connection failure logs to avoid spamming the console
    if (httpCode != -1) {
      Serial.printf("[Commands Poll] Connection failed. HTTP: %d (Host: %s)\n", httpCode, host);
    }
  }

  http.end();
}

void pollCommands() {
  pollCommandsFrom(localHost);
  if (shouldUseVercel()) {
    pollCommandsFrom(vercelHost);
  }
}

// ── Fast-lane override: polls local /api/commands/override every 100ms ──────
// Bypasses Supabase entirely for low-latency manual slider control.
void pollFastLaneOverride() {
  if (WiFi.status() != WL_CONNECTED || !isAutoTracking == false) {
    // Only act on fast-lane when we might need to move servos
  }
  if (WiFi.status() != WL_CONNECTED) return;

  HTTPClient http;
  WiFiClient client;

  String url = String(localHost) + "/api/commands/override?device_id=" + String(DEVICE_ID);
  if (!http.begin(client, url)) {
    http.end();
    return;
  }

  http.setTimeout(200); // Hard 200ms timeout — if local server is slow, skip
  int httpCode = http.GET();

  if (httpCode == HTTP_CODE_OK) {
    String response = http.getString();

    // Only act if a command is present
    if (response.indexOf("\"command\":null") != -1 || response.indexOf("\"command\": null") != -1) {
      http.end();
      return;
    }
    if (response.indexOf("\"action\":\"override\"") == -1 && response.indexOf("\"action\": \"override\"") == -1) {
      http.end();
      return;
    }

    // Parse values
    bool  autoMode = getJsonBool(response, "auto", true);
    int   azimuth  = getJsonInt(response,  "azimuth");
    int   elevation= getJsonInt(response,  "elevation");

    isAutoTracking = autoMode;

    if (!autoMode) {
      if (azimuth != -999) {
        servoH = constrain(90 - azimuth, H_MIN, H_MAX);
        horizontalServo.write(servoH);
      }
      if (elevation != -999) {
        servoV = constrain(elevation, V_MIN, V_MAX);
        verticalServo.write(servoV);
      }
      Serial.printf("[FastLane] Override applied \u2014 H:%d V:%d Auto:%s\n", servoH, servoV, autoMode ? "true" : "false");

      lcd.clear();
      lcd.print("MANUAL [FAST]");
      lcd.setCursor(0, 1);
      lcd.printf("H:%d V:%d", servoH, servoV);
    } else {
      Serial.println("[FastLane] Auto mode restored.");
    }
  }

  http.end();
}

void runCleaningSweep() {
  lcd.clear();
  lcd.print("Sweeping Panel");
  lcd.setCursor(0, 1);
  lcd.print("Cleaning...     ");

  int currentH = servoH;
  int currentV = servoV;

  // Sweep East to West
  for (int h = currentH; h <= H_MAX; h += 2) {
    horizontalServo.write(h);
    delay(15);
  }
  for (int h = H_MAX; h >= H_MIN; h -= 2) {
    horizontalServo.write(h);
    delay(15);
  }
  for (int h = H_MIN; h <= 90; h += 2) {
    horizontalServo.write(h);
    delay(15);
  }
  servoH = 90;

  // Sweep Elevation flat to zenith
  for (int v = currentV; v <= V_MAX; v += 2) {
    verticalServo.write(v);
    delay(15);
  }
  for (int v = V_MAX; v >= V_MIN; v -= 2) {
    verticalServo.write(v);
    delay(15);
  }
  for (int v = V_MIN; v <= 45; v += 2) {
    verticalServo.write(v);
    delay(15);
  }
  servoV = 45;

  isAutoTracking = true;
  lcd.clear();
  lcd.print("Sweep Complete");
  lcd.setCursor(0, 1);
  lcd.print("Mode: AUTO      ");
  delay(1000);
}

void performOTA(String url, String md5) {
  Serial.println("OTA Update: Initializing download...");
  lcd.clear();
  lcd.print("OTA Upgrade");
  lcd.setCursor(0, 1);
  lcd.print("Downloading...");

  HTTPClient http;
  WiFiClientSecure client;
  client.setInsecure(); // Bypass cert checks for local dev bucket URLs

  http.setFollowRedirects(HTTPC_FORCE_FOLLOW_REDIRECTS);
  
  if (!http.begin(client, url)) {
    Serial.println("OTA Error: Failed to open HTTP client");
    lcd.clear();
    lcd.print("OTA Init Fail");
    delay(2000);
    return;
  }

  int httpCode = http.GET();
  if (httpCode == HTTP_CODE_OK) {
    int contentLength = http.getSize();
    WiFiClient* stream = http.getStreamPtr();

    Serial.printf("Binary size: %d bytes\n", contentLength);

    if (md5.length() == 32) {
      Update.setMD5(md5.c_str());
      Serial.println("Target MD5: " + md5);
    }

    if (Update.begin(contentLength)) {
      lcd.setCursor(0, 1);
      lcd.print("Writing Flash..");
      Serial.println("Flashing partition...");

      size_t written = Update.writeStream(*stream);

      if (written == contentLength) {
        Serial.printf("Flashed %d bytes successfully.\n", written);
      } else {
        Serial.printf("Flash write mismatch. Wrote %d/%d bytes.\n", written, contentLength);
      }

      if (Update.end()) {
        if (Update.isFinished()) {
          Serial.println("OTA Complete! Resetting chip...");
          lcd.clear();
          lcd.print("OTA Complete!");
          lcd.setCursor(0, 1);
          lcd.print("Rebooting...");
          delay(2000);
          ESP.restart();
        } else {
          Serial.println("OTA finished but status is not verified.");
        }
      } else {
        Serial.printf("OTA Flashing Error: %d\n", Update.getError());
        lcd.clear();
        lcd.print("OTA Err Code:");
        lcd.setCursor(0, 1);
        lcd.print(Update.getError());
        delay(3000);
      }
    } else {
      Serial.println("OTA Error: Insufficient flash storage partition size.");
      lcd.clear();
      lcd.print("OTA Space Error");
      delay(3000);
    }
  } else {
    Serial.printf("OTA download failed. GET response: %d\n", httpCode);
    lcd.clear();
    lcd.print("Download Failed");
    delay(3000);
  }

  http.end();
}
